#GIT - это распределение система контроля версий
#Это система для отслеживание и ведение истории изменение файлов в нашем проекте
#При помощи GIT можно организовать командную работу.

#GITHUB - это веб-сайт для расмешение GIT-репозитории совместной разработке проектов.

#Репозиторий - это хранилище нашего кода и истории его изменений

#Команда GIT:
#1) git init -  создает удаленный репозиторий, в той директории, в которой была прописано команда.
#2) gid add . - это команда для добавления изменений в систему отслеживание GIT. (вместо точки можно прописать название директории)
#3) gid commit -m 'комментарий' - это команда для сохранение всех изменений с комментарием к ним.
#4) git branch -m maim - это команда переименовывает главную ветку (master на main)
#5 git remote add origin 'ссылка' - это команда связываетт наш локальный репозиторий с удалённым репозиторием на гитхабе.
#6) git push -u origin <main> - это команда отпраки наших изменений на удалёный репозиторий.


# '============================================================================================================'
#git status - показывает статус репозиторий (какие изменение не закомменчены)
#git branch - показывает на какой ветке вы находитесь.